export const shiftData03 = {
  results: [
    {
      memberId: "1230230083",
      name: "横山皓瑛",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T12:00_調理責任者",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "調理責任者",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1210240197",
      name: "井澤美波",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T12:10_クリーンパトロール",
          date: "2025-11-03",
          start: "12:10",
          end: "12:40",
          role: "クリーンパトロール",
        },
        {
          slotId: "2025-11-03T16:00_調理",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1210230088",
      name: "すぎもとらいぞう",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T10:00_列整理",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "列整理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1540230100",
      name: "阿部莉々加",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T16:00_調理",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1f10230014",
      name: "江口潤",
      assigned: [
        {
          slotId: "2025-11-03T12:00_調理",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1D20230025",
      name: "大澤奏斗",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1G30230034",
      name: "佐々木星",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T10:00_呼び込み",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T16:00_呼び込み",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1330230144",
      name: "小出翔太",
      assigned: [
        {
          slotId: "2025-11-03T10:00_調理責任者",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "調理責任者",
        },
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T10:00_呼び込み",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1F10250152",
      name: "高田龍之介",
      assigned: [
        {
          slotId: "2025-11-03T08:00_準備",
          date: "2025-11-03",
          start: "08:00",
          end: "10:00",
          role: "準備",
        },
        {
          slotId: "2025-11-03T10:00_列整理",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "列整理",
        },
      ],
    },
    {
      memberId: "1F10230293",
      name: "若林佑哉",
      assigned: [
        {
          slotId: "2025-11-03T10:00_会計",
          date: "2025-11-03",
          start: "10:00",
          end: "14:00",
          role: "会計",
        },

        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1230240090",
      name: "田口蒼翔",
      assigned: [
        {
          slotId: "2025-11-03T10:00_調理",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "調理",
        },
      ],
    },
    {
      memberId: "1420240131",
      name: "竹井響",
      assigned: [
        {
          slotId: "2025-11-03T12:00_列整理",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "列整理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1210220184",
      name: "菅壱成",
      assigned: [
        {
          slotId: "2025-11-03T14:00_呼び込み",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "呼び込み",
        },
      ],
    },
    {
      memberId: "1330220199",
      name: "藤澤 光",
      assigned: [
        {
          slotId: "2025-11-03T14:00_呼び込み",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "呼び込み",
        },
      ],
    },
    {
      memberId: "1A11220028",
      name: "吉田千夏",
      assigned: [
        {
          slotId: "2025-11-03T16:00_会計",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "会計",
        },
      ],
    },
    {
      memberId: "1320220061",
      name: "倉田鈴音",
      assigned: [
        {
          slotId: "2025-11-03T14:00_列整理",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "列整理",
        },
      ],
    },
    {
      memberId: "1E10220341",
      name: "光莉",
      assigned: [
        {
          slotId: "2025-11-03T14:00_列整理",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "列整理",
        },
      ],
    },
    {
      memberId: "1420230022",
      name: "鈴木陽香",
      assigned: [
        {
          slotId: "2025-11-03T14:00_調理責任者",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "調理責任者",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1H10230039",
      name: "丸山悠衣",
      assigned: [
        {
          slotId: "2025-11-03T14:00_調理",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1230250061",
      name: "斉藤公紀",
      assigned: [
        {
          slotId: "2025-11-03T14:00_調理",
          date: "2025-11-03",
          start: "14:00",
          end: "16:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1330230030",
      name: "川上瑠南",
      assigned: [
        {
          slotId: "2025-11-03T16:00_調理責任者",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "調理責任者",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1220240019",
      name: "音田彩乃",
      assigned: [
        {
          slotId: "2025-11-03T12:00_呼び込み",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T16:00_呼び込み",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1210240247",
      name: "安田結稀",
      assigned: [
        {
          slotId: "2025-11-03T12:10_クリーンパトロール",
          date: "2025-11-03",
          start: "12:10",
          end: "12:40",
          role: "クリーンパトロール",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1220240007",
      name: "金山尋南",
      assigned: [
        {
          slotId: "2025-11-03T10:00_呼び込み",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T12:10_クリーンパトロール",
          date: "2025-11-03",
          start: "12:10",
          end: "12:40",
          role: "クリーンパトロール",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1F10250189",
      name: "加藤大貴",
      assigned: [
        {
          slotId: "2025-11-03T12:00_列整理",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "列整理",
        },
        {
          slotId: "2025-11-03T16:00_列整理",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "列整理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1F10250224",
      name: "菅野凌央",
      assigned: [
        {
          slotId: "2025-11-03T12:00_調理",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1A20220007",
      name: "相良理人",
      assigned: [
        {
          slotId: "2025-11-03T16:00_調理",
          date: "2025-11-03",
          start: "10:00",
          end: "12:00",
          role: "調理",
        },
        {
          slotId: "2025-11-03T16:00_呼び込み",
          date: "2025-11-03",
          start: "12:00",
          end: "14:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1220220125",
      name: "宇野葵",
      assigned: [
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1E10230352",
      name: "蓑田陽菜",
      assigned: [
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "19:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1420230046",
      name: "堀水伶央菜",
      assigned: [
        {
          slotId: "2025-11-03T16:00_会計",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "会計",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "19:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1D20230188",
      name: "高橋凛汐",
      assigned: [
        {
          slotId: "2025-11-03T16:00_列整理",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "列整理",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "19:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1220240199",
      name: "小田部亜依",
      assigned: [
        {
          slotId: "2025-11-03T10:00_呼び込み",
          date: "2025-11-03",
          start: "16:00",
          end: "18:00",
          role: "呼び込み",
        },
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
    {
      memberId: "1H20230044",
      name: "樋口彩妃",
      assigned: [
        {
          slotId: "2025-11-03T18:00_片付け",
          date: "2025-11-03",
          start: "18:00",
          end: "20:00",
          role: "片付け",
        },
      ],
    },
  ],
  creationResult: {
    ok: true,
    reasons: [],
  },
};
